OpenYellow/src/InformationRegisters/СтатистикаРепозиториев/СтатистикаРепозиториев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаРепозиториев</name>
  <resources>
    <name>Звезды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подписчики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Форки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрошлоеМесто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Репозиторий</name>
    <type>
      <types>CatalogRef.Репозитории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

OpenYellow/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Динамика</name>
      <description>Динамика</description>
    </items>
  </predefined>
  <attributes>
    <name>Файл</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Путь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

OpenYellow/src/CommonModules/МетодыТелеграм/Module.bsl
//@skip-check Undefined variable

Процедура ОпубликоватьНовыйРепозиторий(Репозиторий) Экспорт
    
    Попытка
    Токен = Константы.ТокенТелеграм.Получить();
    Чат   = Константы.ЧатТелеграм.Получить();
    
    Шаблон = "<b>Пополнение!</b>
    |Новый проект от %1 - <a href=""%3"">%2</a>!
    |
    |%7
    |
    |Язык: %4
    |Лицензия: %5
    |Ссылка: %6
    |";
    
    Текст = СтрШаблон(Шаблон
        , Репозиторий.Автор.Наименование
        , Репозиторий.Наименование
        , Репозиторий.URL
        , ?(ЗначениеЗаполнено(Репозиторий.Язык), Репозиторий.Язык, "другое")
        , ?(ЗначениеЗаполнено(Репозиторий.Лицензия), Репозиторий.Лицензия, "нет")
        , Репозиторий.URL
        , Репозиторий.Описание);
            
    Ответ = OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, Чат, Текст, , "HTML");
    
    Исключение
        Инструментарий.ЗаписатьИсключение(ОписаниеОшибки());
    КонецПопытки;
 
КонецПроцедуры

Процедура ОпубликоватьИзменения() Экспорт
    
    Попытка
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 500
        |   СтатистикаРепозиториев.Репозиторий КАК Репозиторий,
        |   СтатистикаРепозиториев.ПрошлоеМесто КАК ПрошлоеМесто,
        |   АВТОНОМЕРЗАПИСИ() КАК ТекущееМесто
        |ПОМЕСТИТЬ Отбор
        |ИЗ
        |   РегистрСведений.СтатистикаРепозиториев КАК СтатистикаРепозиториев
        |
        |УПОРЯДОЧИТЬ ПО
        |   СтатистикаРепозиториев.Звезды УБЫВ,
        |   СтатистикаРепозиториев.Форки УБЫВ,
        |   СтатистикаРепозиториев.Репозиторий.ДатаСоздания
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   Отбор.Репозиторий.Автор.Наименование + ""/"" + Отбор.Репозиторий.Наименование КАК Репозиторий,
        |   Отбор.Репозиторий.URL КАК URL,
        |   Отбор.ПрошлоеМесто КАК ПрошлоеМесто
        |ИЗ
        |   Отбор КАК Отбор
        |
        |УПОРЯДОЧИТЬ ПО
        |   Отбор.ТекущееМесто";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        Возврат;
    КонецЕсли;
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    ТаблицаЗапроса         = Новый ТаблицаЗначений;
    
    ТаблицаЗапроса.Колонки.Добавить("Репозиторий");
    ТаблицаЗапроса.Колонки.Добавить("URL");
    ТаблицаЗапроса.Колонки.Добавить("ПрошлоеМесто");
    ТаблицаЗапроса.Колонки.Добавить("ТекущееМесто");
    ТаблицаЗапроса.Колонки.Добавить("Изменение");
    
    Счетчик = 1;
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

        Если Счетчик < ВыборкаДетальныеЗаписи.ПрошлоеМесто Тогда
            
            НоваяПозиция = ТаблицаЗапроса.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяПозиция, ВыборкаДетальныеЗаписи);
            НоваяПозиция.ТекущееМесто = Счетчик;
            НоваяПозиция.Изменение    = ВыборкаДетальныеЗаписи.ПрошлоеМесто - Счетчик;
            
        КонецЕсли;
        
        Счетчик = Счетчик + 1;
    КонецЦикла;
    
    Если ТаблицаЗапроса.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;
    
    ТаблицаЗапроса.Сортировать("Изменение УБЫВ");
    ОтправитьИзменениеВТелеграм(ТаблицаЗапроса);
    
    Исключение
        Инструментарий.ЗаписатьИсключение(ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

Процедура ОпубликоватьРелиз(Знач Репозиторий, Знач Версия, Знач Дата) Экспорт
    
    Попытка
    Токен = Константы.ТокенТелеграм.Получить();
    Чат   = Константы.ЧатТелеграм.Получить();
    
    Автор       = Репозиторий.Автор.Наименование;
    Название    = Репозиторий.Наименование;
    
    URL = "https://github.com/" + Автор + "/" + Название;
    
    Текст = "<b>Новый релиз!</b>
    |
    |Репозиторий: <a href=""" + URL + """>" + Автор + "/" + Название + "</a>
    |Версия: " + Версия + "
    |Дата релиза: " + Формат(Дата, "ДЛФ=DD") + "
    |
    |<a href=""" + URL + "/releases/tag/" + Версия + """>Перейти к релизу</a>";
    
    Ответ = OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, Чат, Текст, , "HTML");
    
    Исключение
        Инструментарий.ЗаписатьИсключение(ОписаниеОшибки());
    КонецПопытки;
    
КонецПроцедуры

Процедура ОтправитьИзменениеВТелеграм(Знач ТаблицаИзменений)
    
    Токен = Константы.ТокенТелеграм.Получить();
    Чат   = Константы.ЧатТелеграм.Получить();
    Вывод = 10;

    МакетОдного = Символы.ПС + "<b>#%4</b> - <a href=""%2"">%1</a> поднялся на %3 позиции(-й)";
    Текст       = "<b>Динамика изменения ТОП-500 за сегодня!</b>" + Символы.ПС; 
    Рейтинг     = "https://openyellow.notion.site/24727888daa641af95514b46bee4d6f2?v=9e43a4185abb44ef9a9457728afb42ff";
    
    Счетчик = 0;
    Для Каждого Позиция Из ТаблицаИзменений Цикл
        
        Если Счетчик < Вывод Тогда
            
            ТекущееМесто = ТабуляцияТекущегоМеста(Позиция.ТекущееМесто);
            Текст = Текст 
                + СтрШаблон(МакетОдного
                    , Позиция.Репозиторий
                    , Позиция.URL
                    , Позиция.Изменение
                    , ТекущееМесто);
        КонецЕсли;
                
        Счетчик = Счетчик + 1;
    КонецЦикла;
    
    Если Счетчик > Вывод Тогда
        Остаток = Счетчик - Вывод;
        Текст = Текст + Символы.ПС + Символы.ПС 
            + "И еще "
            + Строка(Счетчик)
            + " репозиториев. ";
    КонецЕсли;
        
    Текст = Текст 
        + Символы.ПС
        + Символы.ПС
        + " С полным списком рейтинга можно ознакомиться <a href=""" 
        + Рейтинг 
        + """>в таблице ТОП-500</a>, а разработчики проектов, находящихся в ТОП-е, могут ипользовать <a href="""
        + "https://openyellow.notion.site/OpenYellow-93569e5b8f164a039ed7a2af1e960df2"
        + """>наш значок с указанием номера позиции</a> в своем репозитории";          
    
    Картинка = Справочники.Файлы.Динамика.Файл.Получить();
    Ответ = OPI_Telegram.ОтправитьКартинку(Токен, Чат, Текст, Картинка, , "HTML");
    
КонецПроцедуры

Функция ТабуляцияТекущегоМеста(Знач Значение)
    
    Значение = Строка(Значение);
    
    Пока СтрДлина(Значение) < 3 Цикл
        Значение = Значение + " ";
    КонецЦикла;
    
    Возврат Значение;
    
КонецФункции
